[
  {
    "eventName": "Build Bound Challenge - Elevate Expectations",
    "category": "Gold",
    "one_line_desc": "Build Bound Challenge - Elevate Expectations",
    "description": "Get ready for an electrifying competition that will put your design and construction skills to the test in two thrilling rounds! Students will embark on an exhilarating journey through the dynamic world of civil engineering, where innovation meets real-world challenges.",
    "round_title_1": "Blueprint Blitz",
    "round_desc_1": "Prepare to unleash your creativity and engineering prowess! Teams will be tasked with tackling unique plot areas, each presenting its own set of complexities. Within the allocated time, participants must craft compelling approval plans, showcasing:\n• Innovative 2D plans and elevations\n• Effective space allocation for optimal functionality\n• Sustainable design solutions\n• Compliance with regulations with creative twists",
    "round_title_2": "Bid Battle",
    "round_desc_2": "The excitement continues as teams transition to the high-stakes world of tender quoting! In this fast-paced round, participants will step into the shoes of project managers and estimators. Teams must prepare detailed and competitive quotes for their proposed projects, considering factors such as material costs, labor, timelines, and profit margins. With the clock ticking, teams must harness their negotiation skills and business acumen to present persuasive proposals that stand out from the competition.",
    "eventId": "EVNT0020",
    "contact_name_1": "Arunaa",
    "roll_1": "",
    "contact_mobile_1": "+91 8825851781",
    "contact_name_2": "Akshaya",
    "roll_2": "",
    "contact_mobile_2": "+91 9360286296",
    "hall": "Civil UG Computer Lab & Seminar Hall",
    "eventRules": "Participants can bring their own laptop and charger.",
    "teamSize": "2-3",
    "date": "05",
    "timing": "9:30 AM - 03:00 PM"
  },
  {
    "eventName": "Cipher Craft: Unlocking IS 456:2000",
    "category": "Gold",
    "one_line_desc": "     ",
    "description": "\"Cipher Craft\" is a dynamic and engaging event designed for civil engineering students to put their analytical and problem-solving skills to the test. The event's focus is to decode and crack the IS 456 code, which pertains to the design and construction of reinforced concrete structures. Participants will face a series of challenges, puzzles, and tasks related to IS 456, requiring them to unravel complex codes and gain a deeper understanding of the code's intricacies.",
    "round_title_1": "Bidding Blitz",
    "round_desc_1": "During this phase, a set of 50 questions will be presented one by one to the participants, who will then engage in a bidding process. Participants are required to bid their points in order to answer each question. Each team will commence with a designated amount of points for bidding. The team that places the highest bid will earn the opportunity to respond. Following the bidding, the top 10 teams with the highest points will advance to the subsequent round.",
    "round_title_2": "QR Code Quest",
    "round_desc_2": "Ten cardboard boxes, each containing 25 QR codes, will be placed in a hall. Each team will receive a clue to locate their first box containing their initial QR code along with the corresponding password. Teams must scan the QR code, enter the password. Upon correct entry, they will receive a question related to IS 456: 2000, a clue to find the next box and its corresponding password. Teams must collect 10 questions in this manner to solve a crossword puzzle. The first three teams to complete the crossword will be awarded.",
    "eventId": "EVNT0026",
    "contact_name_1": "Arunaa",
    "roll_1": "",
    "contact_mobile_1": "+918825851781",
    "contact_name_2": "Akshaya",
    "roll_2": "",
    "contact_mobile_2": "+919360286296",
    "hall": "J-313,J-314",
    "eventRules": "ROUND 1:\n->Each team will be allocated 200 points.\n->Bidding time for each question will be 30 seconds.\n->Teams will begin bidding with a base amount of 10 points, with a bidding increment of 5 points.\n->Bidding ceases after 30 seconds, and the highest bid at the end of this period will be accepted.\n->Teams must answer each question within 20 seconds after bidding concludes.\n->For the first 25 questions, bidding occurs after the question is displayed. Correct answers earn 20 points, while incorrect answers incur a deduction of 20 points.\n->For questions 26 - 40 keywords related to the question will be displayed first, followed by bidding. Correct answers yield 25 points, with an incorrect answer resulting in a deduction of 15 points.\n->Questions 41 - 50 will have bidding completed prior to displaying the questions. Correct answers result in a gain of 30 points, while incorrect answers lead to a deduction of 10 points.\n->The top 10 teams with the highest points at the end of the round will progress to the next stage.",
    "teamSize": "2-3",
    "date": "06",
    "timing": "09:30 AM - 12:00 PM"
  }
]